backend/controllers/UsersController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $oldPass = $model->Password ;
        $isLock = $model->Is_Locked;
        $roles =  UserRole::find()->where(['Is_Active' => 1])->orderBy(['Role_Name'=>SORT_ASC])->all();
        $organizations = Organization::find()->where(['Is_Active' => 1])->orderBy([
            'Organization_Name'=>SORT_ASC,
            ])->all();
        $request = Yii::$app->request->post('Users');
        $oldRole = $model->Role_Id;

        if(Yii::$app->request->isAjax && $model->load(Yii::$app->request->post())){
---
SELECT CASE WHEN EXISTS(SELECT * FROM [Role] WHERE ([Role_Id]='2')) THEN 1 ELSE 0 END