common/models/InitialContactTypeQuery.php

SELECT * FROM [Initial_Contact_Type] ORDER BY (SELECT NULL) OFFSET 0 ROWS FETCH NEXT 20 ROWS ONLY
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM [Initial_Contact_Type] WHERE [Initial_Contact_Type_Id]='12'
---
    public function one($db = null)
    {
        return parent::one($db);