common/models/OrganizationQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM [Organization] ORDER BY (SELECT NULL) OFFSET 20 ROWS FETCH NEXT 20 ROWS ONLY

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM [Organization] WHERE [Organization_Id]=1028