common/models/OrgStatusQuery.php

SELECT * FROM [Org_Status]
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM [Org_Status] WHERE [Org_Status_Id]=2
---
    public function one($db = null)
    {
        return parent::one($db);