common/models/RoleQuery.php

SELECT * FROM [Role] ORDER BY (SELECT NULL) OFFSET 0 ROWS FETCH NEXT 20 ROWS ONLY
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM [Role] WHERE [Role_Id]=2
---
    public function one($db = null)
    {
        return parent::one($db);