common/models/UserQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM [User] ORDER BY (SELECT NULL) OFFSET 20 ROWS FETCH NEXT 20 ROWS ONLY

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM [User] WHERE [User_Id]=1