common/models/UserRoleQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM [Role]